# SetCategories Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilterCategoryRule..::..SetCategories Method
FilterCategoryRule Class See Also
---
Sets the rule's categories.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool SetCategories(
	ICollection<ElementId> categories
)
```

Visual Basic
---
```text
Public Function SetCategories ( _
	categories As ICollection(Of ElementId) _
) As Boolean
```

Visual C++
---
```text
public:
bool SetCategories(
	ICollection<ElementId^>^ categories
)
```

# ### Parameters
categories
    Type: System.Collections.Generic..::..ICollection<(Of <(<'ElementId>)>)> The categories.
# ### Return Value
True if the set of categories was changed, false if no change was necessary.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | One of the given categories is not filterable |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FilterCategoryRule Class
Autodesk.Revit.DB Namespace